Ran Plan for dir: `terraform/iam/zerone-id` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.5.7 plan -input=false -refresh -no-color -out \"/home/atlantis/.atlantis/repos/DevopsArtFactory/terraform-provisioning/10/default/terraform/iam/zerone-id/iam::zerone-id-default.tfplan\" -var 'assume_role_arn=arn:aws:iam::066346343248:role/atlantis-zerone-id-admin'" in "/home/atlantis/.atlantis/repos/DevopsArtFactory/terraform-provisioning/10/default/terraform/iam/zerone-id": exit status 1
data.terraform_remote_state.kms: Reading...
data.terraform_remote_state.demo_tmcdapne2: Reading...
aws_iam_user.zerone: Refreshing state... [id=zerone]
data.terraform_remote_state.kms: Still reading... [10s elapsed]
data.terraform_remote_state.demo_tmcdapne2: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_group.devops_black will be created
  + resource "aws_iam_group" "devops_black" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "devops_black"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.devops_black will be created
  + resource "aws_iam_group_membership" "devops_black" {
      + group = "devops_black"
      + id    = (known after apply)
      + name  = "devops_black"
      + users = [
          + "zerone",
        ]
    }

  # aws_iam_group_policy_attachment.devops_black will be created
  + resource "aws_iam_group_policy_attachment" "devops_black" {
      + group      = "devops_black"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Error: AccessDenied: User: arn:aws:sts::066346343248:assumed-role/atlantis-ecs_task_execution/cdfd6c273e7f46aca22453a55dd2987d is not authorized to perform: s3:GetObject on resource: "arn:aws:s3:::zerone-id-apnortheast2-tfstate/provisioning/terraform/kms/zerone-id/ap-northeast-2/terraform.tfstate" because no identity-based policy allows the s3:GetObject action
	status code: 403, request id: SXFXA8WX5C5KXSN5, host id: 8sDkziWVCVcMgBnwyuFgw+epRIr720bqzLlx+TuA60qZ58CQjE4lk/Qi8ViZu222FUY3/ZBtocc=


Error: AccessDenied: User: arn:aws:sts::066346343248:assumed-role/atlantis-ecs_task_execution/cdfd6c273e7f46aca22453a55dd2987d is not authorized to perform: s3:GetObject on resource: "arn:aws:s3:::zerone-id-apnortheast2-tfstate/provisioning/terraform/ecs/demo/tmcd_apnortheast2/terraform.tfstate" because no identity-based policy allows the s3:GetObject action
	status code: 403, request id: SXFYNBYGSHN3RBYQ, host id: 82Gc9Gg6ALgv/tEq0tW9ei+4X1HkSs2CRiSlOcC3DRaDH0PIT6N0Jmo20MnxdcxO6dAh47dOj9U=


```
</details>

